question_data = [
    {
        "question": "5-ий Стандарт мови розмітки гіпертексту  HTML5 був оприлюднений у 2014 році", 
        "correct_answer": "Y"
    },
    {
        "question": "Перша помилка комп'ютера була ініційована несправними проводами",
        "correct_answer": "N"
    },
    {
        "question": "FLAC є скороченою назвою 'вільний аудіокодек без втрат'.",
        "correct_answer": "Y"
    },
    {
        "question": "В системі Windows коди програм можуть бути скомпілованими в *.EXE файли. Потім, цей файл може бути виконаний на будь-якої машині",
        "correct_answer": "N"
    },
    {
        "question": "Лінус Торвальдс створив Linux і Git.",
        "correct_answer": "Y"
    },
    {
        "question": "Мова програмування 'Python' базується на модифікованій версії 'JavaScript'",
        "correct_answer": "Y"
    },
    {
        "question": "Компанія AMD першою розробила 64-bit процесор для ринку.",
        "correct_answer": "Y"
    },
    {
        "question": "'HTML' можна перекласти як мова розмітки гіпертексту.",
        "correct_answer": "Y"
    },
    {
        "question": "У більшості мов програмування оператор ++ еквівалентний оператору '+= 1'.",
        "correct_answer": "Y"
    },
    {
        "question": "ПК IBM PC використовував мікропроцесор Intel 8008 з тактовою частотою 4,77 МГц та 8 кілобайтами пам'яті.",
        "correct_answer": "N"
    }
]
